ARMmbed/mbed-os/targets/TARGET_Atmel/TARGET_SAM_CortexM0P/utils/cmsis/TARGET_SAMD21/include/component/comp_tcc_lighting.h
// DITH4 mode
#define TCC_PER_DITH4_DITHERCY_Pos  0            /**< \brief (TCC_PER_DITH4) Dithering Cycle Number */
#define TCC_PER_DITH4_DITHERCY_Msk  (0xFul << TCC_PER_DITH4_DITHERCY_Pos)
#define TCC_PER_DITH4_DITHERCY(value) ((TCC_PER_DITH4_DITHERCY_Msk & ((value) << TCC_PER_DITH4_DITHERCY_Pos)))
#define TCC_PER_DITH4_PER_Pos       4            /**< \brief (TCC_PER_DITH4) Period Value */
#define TCC_PER_DITH4_PER_Msk       (0xFFFFFul << TCC_PER_DITH4_PER_Pos)
#define TCC_PER_DITH4_PER(value)    ((TCC_PER_DITH4_PER_Msk & ((value) << TCC_PER_DITH4_PER_Pos)))
#define TCC_PER_DITH4_MASK          0x00FFFFFFul /**< \brief (TCC_PER_DITH4) MASK Register */

// DITH5 mode
#define TCC_PER_DITH5_DITHERCY_Pos  0            /**< \brief (TCC_PER_DITH5) Dithering Cycle Number */
#define TCC_PER_DITH5_DITHERCY_Msk  (0x1Ful << TCC_PER_DITH5_DITHERCY_Pos)
#define TCC_PER_DITH5_DITHERCY(value) ((TCC_PER_DITH5_DITHERCY_Msk & ((value) << TCC_PER_DITH5_DITHERCY_Pos)))
#define TCC_PER_DITH5_PER_Pos       5            /**< \brief (TCC_PER_DITH5) Period Value */
#define TCC_PER_DITH5_PER_Msk       (0x7FFFFul << TCC_PER_DITH5_PER_Pos)
#define TCC_PER_DITH5_PER(value)    ((TCC_PER_DITH5_PER_Msk & ((value) << TCC_PER_DITH5_PER_Pos)))
#define TCC_PER_DITH5_MASK          0x00FFFFFFul /**< \brief (TCC_PER_DITH5) MASK Register */

// DITH6 mode
#define TCC_PER_DITH6_DITHERCY_Pos  0            /**< \brief (TCC_PER_DITH6) Dithering Cycle Number */
#define TCC_PER_DITH6_DITHERCY_Msk  (0x3Ful << TCC_PER_DITH6_DITHERCY_Pos)
#define TCC_PER_DITH6_DITHERCY(value) ((TCC_PER_DITH6_DITHERCY_Msk & ((value) << TCC_PER_DITH6_DITHERCY_Pos)))
#define TCC_PER_DITH6_PER_Pos       6            /**< \brief (TCC_PER_DITH6) Period Value */
#define TCC_PER_DITH6_PER_Msk       (0x3FFFFul << TCC_PER_DITH6_PER_Pos)
#define TCC_PER_DITH6_PER(value)    ((TCC_PER_DITH6_PER_Msk & ((value) << TCC_PER_DITH6_PER_Pos)))
#define TCC_PER_DITH6_MASK          0x00FFFFFFul /**< \brief (TCC_PER_DITH6) MASK Register */

#define TCC_PER_PER_Pos             0            /**< \brief (TCC_PER) Period Value */
#define TCC_PER_PER_Msk             (0xFFFFFFul << TCC_PER_PER_Pos)
#define TCC_PER_PER(value)          ((TCC_PER_PER_Msk & ((value) << TCC_PER_PER_Pos)))
#define TCC_PER_MASK                0x00FFFFFFul /**< \brief (TCC_PER) MASK Register */

/* -------- TCC_CC : (TCC Offset: 0x44) (R/W 32) Compare and Capture -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct { // DITH4 mode
        uint32_t DITHERCY: 4;      /*!< bit:  0.. 3  Dithering Cycle Number             */
        uint32_t CC: 20;           /*!< bit:  4..23  Channel Compare/Capture Value      */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH4;                     /*!< Structure used for DITH4                        */
    struct { // DITH5 mode
        uint32_t DITHERCY: 5;      /*!< bit:  0.. 4  Dithering Cycle Number             */
        uint32_t CC: 19;           /*!< bit:  5..23  Channel Compare/Capture Value      */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH5;                     /*!< Structure used for DITH5                        */
    struct { // DITH6 mode
        uint32_t DITHERCY: 6;      /*!< bit:  0.. 5  Dithering Cycle Number             */
        uint32_t CC: 18;           /*!< bit:  6..23  Channel Compare/Capture Value      */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } DITH6;                     /*!< Structure used for DITH6                        */
    struct {
        uint32_t CC: 24;           /*!< bit:  0..23  Channel Compare/Capture Value      */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TCC_CC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TCC_CC_OFFSET               0x44         /**< \brief (TCC_CC offset) Compare and Capture */
#define TCC_CC_RESETVALUE           0x00000000ul /**< \brief (TCC_CC reset_value) Compare and Capture */

// DITH4 mode
#define TCC_CC_DITH4_DITHERCY_Pos   0            /**< \brief (TCC_CC_DITH4) Dithering Cycle Number */
#define TCC_CC_DITH4_DITHERCY_Msk   (0xFul << TCC_CC_DITH4_DITHERCY_Pos)
#define TCC_CC_DITH4_DITHERCY(value) ((TCC_CC_DITH4_DITHERCY_Msk & ((value) << TCC_CC_DITH4_DITHERCY_Pos)))
#define TCC_CC_DITH4_CC_Pos         4            /**< \brief (TCC_CC_DITH4) Channel Compare/Capture Value */
#define TCC_CC_DITH4_CC_Msk         (0xFFFFFul << TCC_CC_DITH4_CC_Pos)
#define TCC_CC_DITH4_CC(value)      ((TCC_CC_DITH4_CC_Msk & ((value) << TCC_CC_DITH4_CC_Pos)))
#define TCC_CC_DITH4_MASK           0x00FFFFFFul /**< \brief (TCC_CC_DITH4) MASK Register */

// DITH5 mode
#define TCC_CC_DITH5_DITHERCY_Pos   0            /**< \brief (TCC_CC_DITH5) Dithering Cycle Number */
#define TCC_CC_DITH5_DITHERCY_Msk   (0x1Ful << TCC_CC_DITH5_DITHERCY_Pos)
#define TCC_CC_DITH5_DITHERCY(value) ((TCC_CC_DITH5_DITHERCY_Msk & ((value) << TCC_CC_DITH5_DITHERCY_Pos)))
#define TCC_CC_DITH5_CC_Pos         5            /**< \brief (TCC_CC_DITH5) Channel Compare/Capture Value */
#define TCC_CC_DITH5_CC_Msk         (0x7FFFFul << TCC_CC_DITH5_CC_Pos)
#define TCC_CC_DITH5_CC(value)      ((TCC_CC_DITH5_CC_Msk & ((value) << TCC_CC_DITH5_CC_Pos)))
#define TCC_CC_DITH5_MASK           0x00FFFFFFul /**< \brief (TCC_CC_DITH5) MASK Register */

// DITH6 mode
#define TCC_CC_DITH6_DITHERCY_Pos   0            /**< \brief (TCC_CC_DITH6) Dithering Cycle Number */
#define TCC_CC_DITH6_DITHERCY_Msk   (0x3Ful << TCC_CC_DITH6_DITHERCY_Pos)
#define TCC_CC_DITH6_DITHERCY(value) ((TCC_CC_DITH6_DITHERCY_Msk & ((value) << TCC_CC_DITH6_DITHERCY_Pos)))
#define TCC_CC_DITH6_CC_Pos         6            /**< \brief (TCC_CC_DITH6) Channel Compare/Capture Value */
#define TCC_CC_DITH6_CC_Msk         (0x3FFFFul << TCC_CC_DITH6_CC_Pos)
#define TCC_CC_DITH6_CC(value)      ((TCC_CC_DITH6_CC_Msk & ((value) << TCC_CC_DITH6_CC_Pos)))
#define TCC_CC_DITH6_MASK           0x00FFFFFFul /**< \brief (TCC_CC_DITH6) MASK Register */

#define TCC_CC_CC_Pos               0            /**< \brief (TCC_CC) Channel Compare/Capture Value */
#define TCC_CC_CC_Msk               (0xFFFFFFul << TCC_CC_CC_Pos)
#define TCC_CC_CC(value)            ((TCC_CC_CC_Msk & ((value) << TCC_CC_CC_Pos)))
#define TCC_CC_MASK                 0x00FFFFFFul /**< \brief (TCC_CC) MASK Register */

/* -------- TCC_PATTB : (TCC Offset: 0x64) (R/W 16) Pattern Buffer -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint16_t PGEB0: 1;         /*!< bit:      0  Pattern Generator 0 Output Enable Buffer */
        uint16_t PGEB1: 1;         /*!< bit:      1  Pattern Generator 1 Output Enable Buffer */
        uint16_t PGEB2: 1;         /*!< bit:      2  Pattern Generator 2 Output Enable Buffer */
        uint16_t PGEB3: 1;         /*!< bit:      3  Pattern Generator 3 Output Enable Buffer */
        uint16_t PGEB4: 1;         /*!< bit:      4  Pattern Generator 4 Output Enable Buffer */
        uint16_t PGEB5: 1;         /*!< bit:      5  Pattern Generator 5 Output Enable Buffer */
        uint16_t PGEB6: 1;         /*!< bit:      6  Pattern Generator 6 Output Enable Buffer */
        uint16_t PGEB7: 1;         /*!< bit:      7  Pattern Generator 7 Output Enable Buffer */
        uint16_t PGVB0: 1;         /*!< bit:      8  Pattern Generator 0 Output Enable  */
        uint16_t PGVB1: 1;         /*!< bit:      9  Pattern Generator 1 Output Enable  */
        uint16_t PGVB2: 1;         /*!< bit:     10  Pattern Generator 2 Output Enable  */
        uint16_t PGVB3: 1;         /*!< bit:     11  Pattern Generator 3 Output Enable  */
        uint16_t PGVB4: 1;         /*!< bit:     12  Pattern Generator 4 Output Enable  */
        uint16_t PGVB5: 1;         /*!< bit:     13  Pattern Generator 5 Output Enable  */
        uint16_t PGVB6: 1;         /*!< bit:     14  Pattern Generator 6 Output Enable  */
        uint16_t PGVB7: 1;         /*!< bit:     15  Pattern Generator 7 Output Enable  */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint16_t PGEB: 8;          /*!< bit:  0.. 7  Pattern Generator x Output Enable Buffer */
        uint16_t PGVB: 8;          /*!< bit:  8..15  Pattern Generator x Output Enable  */
    } vec;                       /*!< Structure used for vec  access                  */
    uint16_t reg;                /*!< Type      used for register access              */
} TCC_PATTB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

